# -*- coding:utf-8 -*-

area_code = {
    u'北京': '11102',
    u'天津': '12101',
    u'河北': '13102',
    u'冀北': '13103',
    u'山西': '14101',
    u'蒙东': '15101',
    u'辽宁': '21101',
    u'吉林': '22101',
    u'上海': '31102',
    u'江苏': '32101',
    u'浙江': '33101',
    u'安徽': '34101',
    u'福建': '35101',
    u'江西': '36101',
    u'山东': '37101',
    u'河南': '41101',
    u'湖北': '42102',
    u'湖南': '43101',
    u'重庆': '50101',
    u'四川': '51101',
    u'西藏': '54101',
    u'陕西': '61102',
    u'甘肃': '62101',
    u'青海': '63101',
    u'宁夏': '64101',
    u'新疆': '65101',
}


AREA_TYPE = {
    u'全国': '1',
    u'省': '2',
    u'市': '3',
}

NAME_FILTER_FLAG = {
    u'否': '0',
    u'是': '1',
}

IS_RANDOM = {
    u'否': '0',
    u'是': '1',
}

AWARD_TYPE = {
    u'红包': '01',
    u'积分': '02',
    u'抽奖机会': '03',
}

IS_LOTTERY = {
    u'否': 0,
    u'是': 1,
}

IS_DOUBLE = {
    u'否': 0,
    u'是': 1,
}